using System.ComponentModel.DataAnnotations;

namespace Entekhab.UIServices.ViewModels.Infrastructures.Abstracts;

public class DetailViewModel
{
    //================================================================================================================
    //  Model Properties
    //================================================================================================================
    /// <summary>
    /// شناسه کاربر ايجاد کننده
    /// </summary>
    [ScaffoldColumn(false)]
    [Display(Name = "شناسه کاربر ايجاد کننده")]
    [Required(ErrorMessage = "لطفاً کاربر ایجاد کننده را مشخص نمایید")]
    public string CreatorUserId { get; set; }
    //================================================================================================================
    /// <summary>
    /// ايجاد کننده
    /// </summary>
    [Display(Name = "ايجاد کننده")]
    public string CreatorUserName { get; set; }
    //================================================================================================================
    /// <summary>
    /// تاريخ ايجاد
    /// </summary>
    [Display(Name = "تاريخ و زمان ايجاد")]
    [Required(ErrorMessage = "لطفاً تاریخ و زمان ایجاد را مشخص نمایید")]
    public string CreateDateTime { get; set; }
    //================================================================================================================
    /// <summary>
    /// شناسه کاربر ويرايش کننده
    /// </summary>
    [ScaffoldColumn(false)]
    [Display(Name = "شناسه کاربر ويرايش کننده")]
    public string EditorUserId { get; set; }
    //================================================================================================================
    /// <summary>
    /// ويرايش کننده
    /// </summary>
    [Display(Name = "ويرايش کننده")]
    public string EditorUserName { get; set; }
    //================================================================================================================
    /// <summary>
    /// تاريخ ويرايش براساس فرمت ساعت جهاني
    /// </summary>
    [Display(Name = "تاريخ و زمان ويرايش")]
    public string EditDateTime { get; set; }
    //================================================================================================================
}